Repository: pyschool/story
Catalog: story/locale/*/LC_MESSAGES/pyschool.po
Languages: es

source: Good job! You've completed the adventure
es: ¡Buen Trabajo! Has completado la aventura

source: It didn't work. Try again.
es: No funcionó. Prueba nuevamente

source: {story_title}: {adventure_title} ============================================================================== {adventure_problem} ------------------------------------------------------------------------------ » To print these instructions again, run: {script} print » To execute your program in a test environment, run: {script} run program.py » To verify your program, run: {script} verify program.py » For help run: {script} help
es: {story_title}: {adventure_title} ============================================================================== {adventure_problem} ------------------------------------------------------------------------------ » Para mostrar estas instrucciones otra vez ejecuta: {script} print » Para ejecutar tu programa en un ambiente de desarrollo, ejecuta: {script} run programa.py » Para verificar tu programa, ejecuta: {script} verify program.py » Para más ayuda Ejecuta: {script} help

source: {story_title}: {adventure_title} [SOLUTION] ============================================================================== {adventure_solution} ------------------------------------------------------------------------------ » To print these instructions again, run: {script} print » To execute your program in a test environment, run: {script} run program.py » To verify your program, run: {script} verify program.py » For help run: {script} help
es: {story_title}: {adventure_title} [SOLUCIÓN] ============================================================================== {adventure_solution} ------------------------------------------------------------------------------ » Para mostrar estas instrucciones otra vez ejecuta: {script} print » Para ejecutar tu programa en un ambiente de desarrollo, ejecuta: {script} run programa.py » Para verificar tu programa, ejecuta: {script} verify program.py » Para más ayuda Ejecuta: {script} help

source: Show a menu to interactively select an adventure.
es: Muestra un menú para seleccionar una aventura de manera interactiva

source: Show a newline-separated list of all the adventures.
es: Muestra una lista de todas las aventuras separadas por un fin de línea

source: Select an adventure.
es: Selecciona una aventura

source: Show the currently selected adventure.
es: Muestra la aventura seleccionada actualmente

source: Please select an adventure first.
es: Selecciona una aventura primero.

source: Invalid adventure: {}.
es: Aventura inválida: {}.

source: Print the adventure.
es: Muestra la información de la aventura.

source: Print the instructions for the next incomplete adventure after the currently selected adventure.
es: Muestra las instrucciones para la siguiente aventura no completada, luego de la aventura que está seleccionada actualmente.

source: Not implemented.
es: No está implementado

source: Reset completed adventure progress.
es: Reinicia el progreso de las aventuras completas.

source: Run your program against the selected input.
es: Corre tu programa contra la entrada seleccionada.

source: Verify the solution for the current adventure.
es: Verifica la solución para la aventura actual.

source: Print the solution for an adventure.
es: Imprime la solución para una aventura

source: Change the system to the specified language.
es: Cambia el sistema al idioma especificado

source: Select an exercise and hit ENTER to begin
es: Selecciona un ejercicio y presiona ENTER para comenzar

source: COMPLETED
es: COMPLETO

source: Choose language
es: Elige un idioma

source: Choose a language:
es: Elige un idioma

source: CURRENT
es: SELECCIONADO

source: Help
es: Ayuda

source: Cancel
es: Cancelar

source: Exit
es: Salir

source: English
es: Inglés

source: Spanish
es: Español
